---
kind: type
id: T:Autodesk.Revit.DB.Architecture.WinderPathResult
source: html/4e13811c-ffa6-f862-c7b5-2d75f0797d3f.htm
---
# Autodesk.Revit.DB.Architecture.WinderPathResult

Flag indicates whether curves are valid to use as base lines for winder path.

## Syntax (C#)
```csharp
public enum WinderPathResult
```